{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 3, 128, 38], "name": "convolution2d_1", "activation": "elu", "nb_col": 5, "nb_row": 5, "input_dtype": "float32", "trainable": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "th", "nb_filter": 24, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_2", "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "th", "nb_filter": 36}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_3", "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "th", "nb_filter": 48}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_4", "activation": "relu", "nb_col": 2, "nb_row": 2, "trainable": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "th", "nb_filter": 64}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "trainable": true, "activation": "relu", "input_dim": 768, "bias": true, "b_regularizer": null, "output_dim": 786, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "trainable": true, "activation": "relu", "input_dim": 786, "bias": true, "b_regularizer": null, "output_dim": 50, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activation": "tanh", "input_dim": 50, "bias": true, "b_regularizer": null, "output_dim": 1, "W_regularizer": null}}]}